
&НаКлиенте
Процедура АдресФотографииНажатие(Элемент, СтандартнаяОбработка)
	
	ООЗавершениеПомещенияФайла = Новый ОписаниеОповещения("ЗавершениеПомещенияФайла", ЭтаФорма);
	НачатьПомещениеФайла(ООЗавершениеПомещенияФайла, , , Истина, ЭтаФорма.УникальныйИдентификатор);
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеПомещенияФайла(Результат, АдресПомещенногоФайла, ВыбранноеИмяФайла, ДополнительныйПараметр) Экспорт
	
	Если Результат = Истина Тогда
		
		АдресФотографии = АдресПомещенногоФайла;
		Модифицированность = Истина;
		
	КонецЕсли;	
		
КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не ПустаяСтрока(АдресФотографии) Тогда
		
		Попытка
			ТекущийОбъект.ХранилищеФотографии = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресФотографии));
		Исключение
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если ТекущийОбъект.ХранилищеФотографии <> Неопределено Тогда
		
		АдресФотографии = ПоместитьВоВременноеХранилище(ТекущийОбъект.ХранилищеФотографии.Получить());
		
	КонецЕсли;
	
	УстановитьФорматРедактированияДаты(Элементы.ДатаРождения, ТекущийОбъект.ТочностьДатыРождения);
	УстановитьФорматРедактированияДаты(Элементы.ДатаСмерти, ТекущийОбъект.ТочностьДатыСмерти);
	УстановитьВидимостьГруппыДатыСмерти(Элементы.ГруппаДатыСмерти, Не ТекущийОбъект.НынеЖив);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьФорматРедактированияДаты(Элемент, ТочностьДаты)
	                                                          
	Если ТочностьДаты = ПредопределенноеЗначение("Перечисление.ТочностьДаты.Год") Или ТочностьДаты = ПредопределенноеЗначение("Перечисление.ТочностьДаты.Десятилетие") Тогда
		Элемент.ФорматРедактирования = "ДФ='yyyy'";
	ИначеЕсли ТочностьДаты = ПредопределенноеЗначение("Перечисление.ТочностьДаты.Месяц") Тогда	
		Элемент.ФорматРедактирования = "ДФ='MM yyyy'";
	Иначе
		Элемент.ФорматРедактирования = "";
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьГруппыДатыСмерти(Элемент, Видимость)
	                                                          
	Элемент.Видимость = Видимость;	
	
КонецПроцедуры

&НаКлиенте
Процедура ТочностьДатыРожденияПриИзменении(Элемент)
	
	УстановитьФорматРедактированияДаты(Элементы.ДатаРождения, Объект.ТочностьДатыРождения);	
	
КонецПроцедуры

&НаКлиенте
Процедура ТочностьДатыСмертиПриИзменении(Элемент)
	
	УстановитьФорматРедактированияДаты(Элементы.ДатаСмерти, Объект.ТочностьДатыСмерти);
	
КонецПроцедуры

&НаКлиенте
Процедура НынеЖивПриИзменении(Элемент)
	
	УстановитьВидимостьГруппыДатыСмерти(Элементы.ГруппаДатыСмерти, Не Объект.НынеЖив);	
	
КонецПроцедуры


