
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПрочитатьФотографию();
	
КонецПроцедуры

Процедура ПрочитатьФотографию()
	
	КаталогФотографий = Константы.ПутьККаталогуСФотографиями.Получить();
	
	Если Не Объект.Ссылка.Пустая() Тогда
		
		УИД = Строка(Объект.Ссылка.УникальныйИдентификатор());
	
		ФайлыФотографий = НайтиФайлы(КаталогФотографий, "*" + УИД + "*", Истина);
		
		Для Каждого Файл Из ФайлыФотографий Цикл
			
			Если СтрНайти(Файл.Имя, УИД) > 0 Тогда
				
				АдресФотографии = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(Файл.ПолноеИмя));
				Прервать;
				
			КонецЕсли;	
			
		КонецЦикла;	
		
	КонецЕсли;	 
	
	
КонецПроцедуры	
